# DetailElementOrderUtils Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DetailElementOrderUtils Class
Members See Also
---
A utility class that arranges the draw order of the detail objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static class DetailElementOrderUtils
```

Visual Basic
---
```text
Public NotInheritable Class DetailElementOrderUtils
```

Visual C++
---
```text
public ref class DetailElementOrderUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DetailElementOrderUtils
# See Also
DetailElementOrderUtils Members
Autodesk.Revit.DB Namespace